artillery.yml
config:
  target: "http://localhost:4001"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load

scenarios:
  - name: "retrieve list of banners"
    flow:
      - get:
          url: "/banners"

  - name: "retrieve list of news"
    flow:
      - get:
          url: "/news"